src/Catalogs/СписокСотрудников/СписокСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СписокСотрудников</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипРаботника</name>
    <type>
      <types>EnumRef.ТипРаботника</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнформацияОСемье</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>EnumRef.Пол</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРодственности</name>
      <type>
        <types>EnumRef.ТипРодственности</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоЖительства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/СписокСотрудников/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Справочники.СписокСотрудников.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокСотрудников.Код,
	|	СписокСотрудников.Наименование,
	|	СписокСотрудников.Пол,
	|	СписокСотрудников.ТипРаботника,
	|	СписокСотрудников.ИнформацияОСемье.(
	|		НомерСтроки,
	|		ФИО,
	|		ДатаРождения,
	|		Пол,
	|		ТипРодственности,
	|		МестоЖительства
	|	)
	|ИЗ
	|	Справочник.СписокСотрудников КАК СписокСотрудников
	|ГДЕ
	|	СписокСотрудников.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьИнформацияОСемьеШапка = Макет.ПолучитьОбласть("ИнформацияОСемьеШапка");
	ОбластьИнформацияОСемье = Макет.ПолучитьОбласть("ИнформацияОСемье");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьИнформацияОСемьеШапка);
		ВыборкаИнформацияОСемье = Выборка.ИнформацияОСемье.Выбрать();
		Пока ВыборкаИнформацияОСемье.Следующий() Цикл
			ОбластьИнформацияОСемье.Параметры.Заполнить(ВыборкаИнформацияОСемье);
			ТабДок.Вывести(ОбластьИнформацияОСемье, ВыборкаИнформацияОСемье.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
